{"pages":[{"title":"介绍一下我自己","text":"一名正在努力奋斗中的程序员，2018年硕士毕业，目前混迹于宇宙第一通信公司———华为。","link":"/about/index.html"}],"posts":[{"title":"葱葱冉冉的小屋正式落成","text":"今天是2018年的倒数第二天，前几天思来想去我该送个什么新年礼物给冉冉好呢，送东西吧，每次都是没有创意，不知道该送啥，发红包吧，又会显得太没有诚意了，(⊙o⊙)…，那我还是发挥我的专长做点儿实际的东西吧，于是“葱葱冉冉的小屋”个人博客就正式落成啦。以前，我就一直想找个地儿给我们自己记录一些事情，前阵子看到冉冉在给学校的公众号号发文章，感觉她文笔还是很有活力的，想必对写东西还是有点儿兴趣。申请一个公众号，虽然简单，但是感觉限制有点儿多了，必须得用微信那一套发文章，写出来的东西还只能在微信里面看，不够灵活，而搭建个人博客是一种很好的选择，说做就做呗，这也难不倒我。但是，个人博客是弄完了，我是把个人博客托管在github上面的，那我总不能用git的域名吧，这样也不能博得红颜一笑呀，于是我就更加用心一点吧，去阿里云买了个有爱的域名，从此以后这个域名就被我承包了，嗯，开心~ 多读书、多写文章、多让冉冉开心，2019加油！ https://lovezr.top","link":"/2018/12/30/葱葱冉冉的小屋正式落成/"},{"title":"2018年终总结","text":"今天是2018年最后一天了，去年元旦跟大姨他们一起吃团圆饭的画面仍然可以很清晰的浮现在我的脑海里。为什么我们越是长大越会觉得时间过得越快，其实是跟我们的经历有关的，对于一个5岁的小孩来说，一年的时间相当于他人生的五分之一，因此他会觉得一年的时间过得非常缓慢，而对于一个80岁的老人来说一年的时间是他已有人生的八十分之一而已，所以他会觉得一年的时间相当快。人生也是一样，我们可以把每过去的一年与往年作比较，如果这一年经历的事情比以前更有多、更刻骨铭心、更值得浏览，那么这一年就是成功的一年。 回想2018年，在学业、工作、爱情和家庭四个方面上都发生了大事，可以说今年是我人生的一个转折年。离开了校园、正式步入了职业生涯、跟冉冉在一起一周年、一直看着我长大的姨父病逝，这些事情让我更加成熟，逐渐的我身上会肩负着更多的责任。 今年年初，应该是我最为焦虑的一段时间，那时候面临着毕业的压力，大论文和小论文都还没有完成，需要整天奔波在大姨家和九龙湖校园间，加之导师又很忙，一直没空帮我们看论文，只能是一拖再拖。小论文要求是四月份发完，大概是三月底导师第一次批改完了小论文，记得那是晚上十点多钟，导师突然打电话过来跟我聊论文的事情把我批评的都开始怀疑人生了，于是开始拼命修改，光是小论文就改了四遍才好，值得庆幸的是小论文发表还算顺利，另外一个兄弟就惨了，又拖了一个月才发出去，幸好软件学院在五月份的时候还有一批小论文发表。不过，小论文发完了才是只是噩梦的开始，后面大论文才是真正的大头，首先我们的论文肯定是写的问题很多，写作水平也是比较低，导师每次看到我们的论文都是一脸嫌弃，但问题的关键是我们论文做的内容是实习过程中接触的东西，并不是导师的研究方向，这就是一个大矛盾，导师一面嫌弃我们写的不好，一面又无法给论文内容本身提出建设性的建议，只能在论文的整体结构、写作文法、用词等方面给我们修改。每次取学校回去，我们两就像是难兄难弟，从学校一路走出回去聊会儿人生然后各自回家。幸运的是，论文经过多次修改最终还是达到了导师的要求，六月初导师同意我送审了，送审的结果也是非常顺利，学校和企业都给出了八十多分，顺利进入答辩程序。当然，得益于导师的严格要求，论文几乎是没有什么问题的，答辩过程非常顺利，答辩组专家只提出了论文本身领域方面的问题，论文本身并没有挑出任何毛病，最终答辩结果还是良好，非常开心，就这样顺利的毕业啦。 论文答辩完，顺利毕业以后，我想着从毕业到工作这段时间可是我近三十年里最安逸的时间了，我可不能这么早就取工作，于是将入职时间推迟到了八月份。这段时间呢，我的主要任务有两个，其一是陪着冉冉一起玩完，其二呢就是我得把我的驾照考完。不过六月份毕业，离七月份冉冉放暑假的时间很近了，我们也并没有玩多少地方，中途去了苏州和扬州两个地方，大概是七月六号左右，我就回去开始学车了。要说这学车，那我是老厉害了，其实在2017年暑假的时候我就报名了，然后一直没空去驾校培训，直到2018年1月的时候才考了科目一，然后2018年7月6号进驾校，7月15、16两天科目二科目三全部顺利通过，前后其实也就练车十来天时间，简直就是教练见过的最具有天赋的学员，几乎不用操心就拿到了驾照，而且是在这极短的时间内。 2018年7月30日是我人生中非常重要的转折点，这一天我正式步入职业生涯，从校园步入了职场，但是我并没有觉得这两者有什么不同，职场对我来说只是一个更大的校园罢了。作为一名IT男，我感觉我们同事之间的关系都非常简单，做技术的嘛，you can you up，当然搞人际关系、拍马屁那些也是很重要的咯，不过暂时我还是以学技术为主，努力进步，艰苦奋斗。说实话，我也并没有非常明确的职业生涯目标，即使有现在也是不作数的，目前我唯一想要的就是别人搞不定的问题我能搞定，生活需要成就感。八月份开始工作，到现在也是五个月了，总得来说我还是很开心，学到很多东西，碰上了一群可爱的人。 今年也度过了我和冉冉的一周年，酸甜苦辣苦都全啦，南京该玩的地方几乎都去过了，今年还去了苏州、扬州、黄山这几个地方玩了一圈，不过还是太少了。自从我上班以后，我们就没有出过南京市玩过了，一到周末就想赖在家里，实在是太不好了。2019年要做出改变，我们要多出去玩，多看电影，多看书，还有更重要的，要多写文章，用文字记录美。 今年最伤心的事情是我大姨父去世，大概从我五岁那年起，我几乎就是和我大姨生活在一起的，姨娘姨父对我来说比我的爷爷奶奶还亲，可以说没有我他们就不会有我的今天。今年7月份我拿到驾照的时候，姨父还是好好的，没有明显的症状，但是到我上班以后身体每况愈下，检查出来已经迟了，悲痛之情溢于言表，直到现在每每想到姨父身前的画面，我还是会情不自禁的流泪。有一次，冉冉问我在我五岁之前的记忆里面，会先想起谁，我说那就是我大姨父了，那是一个黄昏，天气不冷，我姨父把我从我奶奶家那边的幼儿园接到我外婆家，那时候他们县城里的房子拆迁，姨娘和姨父便住在外婆家，那段时光已经模糊了，但是也不知道为什么这个画面就是一直在我脑海里面。 以上，就是2018年发生在我身上的几件重要的事情。祝愿在新的2019年，我和我身边的人都能健健康康，心想事成！ ​ ​ 2019.1.1 ​ 潘聪","link":"/2018/12/31/2018年终总结/"}],"tags":[{"name":"记录","slug":"记录","link":"/tags/记录/"}],"categories":[{"name":"随笔","slug":"随笔","link":"/categories/随笔/"}]}